

module instruction_tb;
    reg            clk;
    reg            rst;
    wire   [19:0]  base_ram_addr; 
    wire   [31:0]  base_ram_data; 
    wire   [3:0]   base_ram_be_n; 
    wire           base_ram_ce_n; 
    wire           base_ram_oe_n; 
    wire           base_ram_we_n; 
    wire   [19:0]  ext_ram_addr; 
    wire   [31:0]  ext_ram_data; 
    wire   [3:0]   ext_ram_be_n; 
    wire           ext_ram_ce_n; 
    wire           ext_ram_oe_n; 
    wire           ext_ram_we_n; 
    
    reg    [31:0]  BASE_SRAM  [63:0];
    reg    [31:0]  EXT_SRAM   [63:0];
    
// ---------------- BaseSRAM£¨Ö»¶Á£©----------------
// Ö»ÓÐ±»Ñ¡ÖÐÇÒ¶ÁÊ¹ÄÜÊ±²ÅÇý¶¯×ÜÏß
assign base_ram_data =
    (!base_ram_ce_n && !base_ram_oe_n && base_ram_we_n) ? BASE_SRAM[base_ram_addr] : 32'hz;

// ---------------- ExtSRAM£¨¶ÁÐ´£©----------------
// ¶Á£º±»Ñ¡ÖÐÇÒOEÓÐÐ§ÇÒWEÎÞÐ§Ê±Çý¶¯×ÜÏß
assign ext_ram_data =
    (!ext_ram_ce_n && !ext_ram_oe_n && ext_ram_we_n) ? EXT_SRAM[ext_ram_addr] : 32'hz;

// Ð´£º±»Ñ¡ÖÐÇÒWEÓÐÐ§Ê±Ð´Èë£¨Ö§³Ö×Ö½ÚÊ¹ÄÜ£¬µÍÓÐÐ§£©
always @(posedge clk) begin
    if(!ext_ram_ce_n && !ext_ram_we_n) begin
        if(!ext_ram_be_n[0]) EXT_SRAM[ext_ram_addr][7:0]   <= ext_ram_data[7:0];
        if(!ext_ram_be_n[1]) EXT_SRAM[ext_ram_addr][15:8]  <= ext_ram_data[15:8];
        if(!ext_ram_be_n[2]) EXT_SRAM[ext_ram_addr][23:16] <= ext_ram_data[23:16];
        if(!ext_ram_be_n[3]) EXT_SRAM[ext_ram_addr][31:24] <= ext_ram_data[31:24];
    end
end
    initial begin
    clk=1'b0;
 /*   BASE_SRAM[0] = 32'b001111_00000_00001_00000000_10001110  ;   // LUIÖ¸Áî                                           
    BASE_SRAM[1] = 32'b001111_00000_00010_00000000_00111110  ;   // LUIÖ¸Áî                                           
    BASE_SRAM[2] = 32'b000000_00001_00010_00011_00000_100001;   // adduÖ¸Áî(½«¼Ä´æÆ÷1µÄÊý¾ÝÓë¼Ä´æÆ÷2Ïà¼Ó·ÅÈë¼Ä´æÆ÷3)                   
    BASE_SRAM[3] = 32'b001111_00000_11111_1000_0000_0100_0000;  // LUIÖ¸Áî(ÔÚ31ºÅ¼Ä´æÆ÷Ð´ÈëEXT_SRAMµÄbase)                   
    BASE_SRAM[4] = 32'b101011_11111_00001_0000000000000000  ;   // SW(½«1ºÅ¼Ä´æÆ÷µÄÖµ´æÈëEXT_SRAM[0])                       
    BASE_SRAM[5] = 32'b100011_11111_00100_0000000000000000  ;   // LW(½«EXT_SRAM[0]µÄÖµÈ¡³ö·ÅÔÚ4ºÅ¼Ä´æ)                      
    BASE_SRAM[6] = 32'b000101_00001_00010_1111111111111101  ;   // BNE(²»µÈ·ÖÖ§)
    */
    

       BASE_SRAM[ 0] = 32'b001101_00000_01000__00000_00000_000001;     // ORI
       BASE_SRAM[ 1] = 32'b001101_00000_01001__00000_00000_000001;     // ORI
       BASE_SRAM[ 2] = 32'b001101_00000_10001__00000_00000_000100;     // ORI
       BASE_SRAM[ 3] = 32'b001101_00000_01100__00000_00100_000000;     // ORI
       BASE_SRAM[ 4] = 32'b001111_00000_00100__10000_00001_000000;     // LUI
       BASE_SRAM[ 5] = 32'b000000_00100_01100__01101_00000_100001;     // ADDU
       BASE_SRAM[ 6] = 32'b000000_01000_01001__01010_00000_100001;     // ADDU
       BASE_SRAM[ 7] = 32'b001101_01001_01000__00000_00000_000000;     // ORI
       BASE_SRAM[ 8] = 32'b001101_01010_01001__00000_00000_000000;     // ORI
       BASE_SRAM[ 9] = 32'b101011_00100_01001__00000_00000_000000;     // SW
       BASE_SRAM[10] = 32'b100011_00100_01011__00000_00000_000000;     // LW
       BASE_SRAM[11] = 32'b000101_01001_01011__00000_00000_000100;     // BNE
       BASE_SRAM[12] = 32'b001101_00000_00000__00000_00000_000000;     // ORI
       BASE_SRAM[13] = 32'b000000_00100_10001__00100_00000_100001;     // ADDU
       BASE_SRAM[14] = 32'b000101_00100_01101__11111_11111_110111;     // BNE
       BASE_SRAM[15] = 32'b001101_00000_00000__00000_00000_000000;     // ORI
       BASE_SRAM[16] = 32'b000101_10001_00000__11111_11111_111111;     // BNE
       BASE_SRAM[17] = 32'b001101_00000_00000__00000_00000_000000;     // ORI
       
       
     /* µÚÒ»²¨Ö¸Áî²âÊÔ
        BASE_SRAM[ 0] = 32'b001111_00000_01111_1000_0000_0100_0000;//½«EXT_SRAMµÄÆðÊ¼µØÖ·´æÈë15ºÅ¼Ä´æÆ÷
        BASE_SRAM[ 1] = 32'b001000_00000_00001_0000000000000001;//1ºÅ¼Ä´æÆ÷ÖÃÎª1        
        BASE_SRAM[ 2] = 32'b001000_00000_00010_0000000000000101;//2ºÅ¼Ä´æÆ÷ÖÃÎª5        
        BASE_SRAM[ 3] = 32'b000000_00001_00010_00011_00000_100000;//3ºÅ¼Ä´æÆ÷=1+5=6   
        BASE_SRAM[ 4] = 32'b000000_00010_00001_00100_00000_100010;//4ºÅ¼Ä´æÆ÷=5-1=4    
        BASE_SRAM[ 5] = 32'b000000_00001_00010_00101_00000_100100;//5ºÅ¼Ä´æÆ÷=5&1=1    
        BASE_SRAM[ 6] = 32'b000000_00001_00010_00110_00000_100101;//6ºÅ¼Ä´æÆ÷=5|1=5    
        BASE_SRAM[ 7] = 32'b001100_00001_00111_0000000000000010;//7ºÅ¼Ä´æÆ÷=1&2=0      
        BASE_SRAM[ 8] = 32'b001101_00001_01000_0000000000000010;//8ºÅ¼Ä´æÆ÷=1|2=3      
        BASE_SRAM[ 9] = 32'b101011_01111_00011_0000_0000_0001_0000;//3ºÅ¼Ä´æÆ÷µÄÖµ£¨6£©´æÈëÄÚ´æÖÐµÄµØÖ·1´¦
        BASE_SRAM[10] = 32'b100011_01111_01001_0000_0000_0001_0000;//´ÓÉÏÒ»¸ö·Ã´æµØÖ·È¡³öÊý¾Ý£¨6£©·ÅÈë9ºÅ¼Ä´æÆ÷
        BASE_SRAM[11] = 32'b000100_00001_00010_0000_0000_0000_0100;//beq²»·¢ÉúÌø×ª
        BASE_SRAM[12] = 32'b001101_00000_00000_00000_00000_000000;//¿ÕÖ¸Áî£¨ÑÓ³Ù²ÛÖ¸Áî£©
        BASE_SRAM[13] = 32'b001000_00000_01010_0000_0000_0000_1000;//10ºÅ¼Ä´æÆ÷=8
        BASE_SRAM[14] = 32'b000101_00001_00010_0000_0000_0000_0010;//Ìø×ªµ½ÑÓ³Ù²ÛÖ¸ÁîÖ®ºóµÄµÚ2Ìõ
        BASE_SRAM[15] = 32'b001101_00000_00000_00000_00000_000000;//¿ÕÖ¸Áî£¨ÑÓ³Ù²ÛÖ¸Áî£©
        BASE_SRAM[16] = 32'b000000_00001_00010_01011_00000_100000;//11ºÅ¼Ä´æÆ÷=1+5=6£¨µ«ÊÇ´ËÌõÖ¸Áî²»Ö´ÐÐ£©
        BASE_SRAM[17] = 32'b001000_00000_01100_0000_0000_0000_1010;//12ºÅ¼Ä´æÆ÷=10
        BASE_SRAM[18] = 32'b000010_0000_0000_0000_0000_0000_0101_01;//Ìø×ªµ½0x8000_0054
        BASE_SRAM[19] = 32'b001101_00000_00000_00000_00000_000000;//¿ÕÖ¸Áî£¨ÑÓ³Ù²ÛÖ¸Áî£©
        BASE_SRAM[20] = 32'b000000_00001_00010_01011_00000_100000;//11ºÅ¼Ä´æÆ÷=1+5=6£¨µ«ÊÇ´ËÌõÖ¸Áî²»Ö´ÐÐ£©
        BASE_SRAM[21] = 32'b000000_00101_01000_01101_00000_101010;//5ºÅ¼Ä´æÆ÷£¨1) < £¨3£©8ºÅ¼Ä´æÆ÷£»13ºÅ¼Ä´æÆ÷ÖÃÎª1
        BASE_SRAM[22] = 32'b000000_00101_00100_01110_00000_101010;//5ºÅ¼Ä´æÆ÷£¨1) < £¨4£©4ºÅ¼Ä´æÆ÷£»14ºÅ¼Ä´æÆ÷ÖÃÎª1*/

/*µÚ¶þ²¨Ö¸Áî²âÊÔ        
        BASE_SRAM[ 0] = 32'b001101_00000_00001_0000000000000101;// ori 1,0,5 ¡ú 1ºÅ¼Ä´æÆ÷ = 5
        BASE_SRAM[ 1] = 32'b001101_00000_00010_0000000000001010;// ori 2,0,10 ¡ú 2ºÅ¼Ä´æÆ÷ = 10
        BASE_SRAM[ 2] = 32'b001101_00000_00011_0000000000000011;// ori 3,0,3 ¡ú 3ºÅ¼Ä´æÆ÷ = 3
        BASE_SRAM[ 3] = 32'b001101_00000_00100_0000000000000100;// ori 4,0,4 ¡ú 4ºÅ¼Ä´æÆ÷ = 4
        
        BASE_SRAM[ 4] = 32'b000000_00001_00010_00101_00000_100110;// xor 5,1,2 ¡ú 5ºÅ¼Ä´æÆ÷ = 1ºÅ ^ 2ºÅ
        BASE_SRAM[ 5] = 32'b001110_00001_00110_0000000011111111;  // xori 6,1,0x00FF ¡ú 6ºÅ¼Ä´æÆ÷ = 1ºÅ ^ 0xFF
        BASE_SRAM[ 6] = 32'b000000_00000_00001_00111_00100_000000;// sll 7,1,4 ¡ú 7ºÅ¼Ä´æÆ÷ = 1ºÅ << 4
        BASE_SRAM[ 7] = 32'b000000_00100_00001_01000_00000_000100;// sllv 8,1,4 ¡ú 8ºÅ¼Ä´æÆ÷ = 1ºÅ << (4ºÅµÍ5Î»)
        BASE_SRAM[ 8] = 32'b000000_00000_00010_01001_00010_000010;// srl 9,2,2 ¡ú 9ºÅ¼Ä´æÆ÷ = 2ºÅ >> 2£¨Âß¼­£©
        BASE_SRAM[ 9] = 32'b000000_00011_00010_01010_00000_000110;// srlv 10,2,3
        BASE_SRAM[10] = 32'b000000_00000_00010_01011_00001_000011;// sra 11,2,1
        BASE_SRAM[11] = 32'b000000_00100_00010_01100_00000_000111;// srav 12,2,4
        BASE_SRAM[12] = 32'b001111_00000_00101_1000000001000000;// lui 5,0x8040 ¡ú 5ºÅ¼Ä´æÆ÷ = 0x80400000£¨ExtRAM »ùÖ·£©
        BASE_SRAM[13] = 32'b101000_00101_00001_0000000000000001;// sb 1,1(5) ¡ú °Ñ1ºÅ¼Ä´æÆ÷µÍ8Î»Ð´Èë ExtRAM[5+1]
        BASE_SRAM[14] = 32'b100000_00101_00110_0000000000000001;// lb 6,1(5) ¡ú ´Ó ExtRAM[5+1] ¶Á 1 ×Ö½Ú£¬·ûºÅÀ©Õ¹µ½ 6ºÅ¼Ä´æÆ÷
        BASE_SRAM[15] = 32'b000001_00001_00001_0000000000000010;// bgez 1,+1 ¡ú Èô1ºÅ¼Ä´æÆ÷ ¡Ý 0 Ìø
        BASE_SRAM[16] = 32'b000000_00000_00000_00000_00000_000000;// nop£¨ÑÓ³Ù²Û£©
        BASE_SRAM[17] = 32'b000001_00001_00000_0000000000000001;// bltz 1,+1 ¡ú Èô1ºÅ¼Ä´æÆ÷ < 0 Ìø
        BASE_SRAM[18] = 32'b000000_00000_00000_00000_00000_000000;// nop
        BASE_SRAM[19] = 32'b000111_00010_00000_0000000000000001;// bgtz 2,+1 ¡ú Èô2ºÅ¼Ä´æÆ÷ > 0 Ìø
        BASE_SRAM[20] = 32'b000000_00000_00000_00000_00000_000000;// nop
        BASE_SRAM[21] = 32'b000110_00011_00000_0000000000000001;// blez 3,+1 ¡ú Èô3ºÅ¼Ä´æÆ÷ ¡Ü 0 Ìø
        BASE_SRAM[22] = 32'b000000_00000_00000_00000_00000_000000;// nop
        BASE_SRAM[23] = 32'b000011_10000000000000000000101000;// jal 0x800000A0 ¡ú 31ºÅ¼Ä´æÆ÷ = ·µ»ØµØÖ·
        BASE_SRAM[24] = 32'b000000_00000_00000_00000_00000_000000;// nop
        BASE_SRAM[40] = 32'b000000_11111_00000_00000_00000_001000;// jr 31 ¡ú Ìø»Ø
        BASE_SRAM[41] = 32'b000000_00000_00000_00000_00000_000000;// nop
*/

/*µÚÈý²¨Ö¸Áî²âÊÔ
        BASE_SRAM[ 0] = 32'b001101_00000_00001_0000000000000011;
        BASE_SRAM[ 1] = 32'b001101_00000_00010_0000000000000100;
        BASE_SRAM[ 2] = 32'b011100_00001_00010_00011_00000_000010;
        BASE_SRAM[ 3] = 32'b001111_00000_00100_1000000000000000;
        BASE_SRAM[ 4] = 32'b001101_00100_00100_0000000001000000;
        BASE_SRAM[ 5] = 32'b000000_00100_00000_11111_00000_001001;
        BASE_SRAM[ 6] = 32'b000000_00000_00000_00000_00000_000000;
        BASE_SRAM[ 7] = 32'b001101_00000_00101_0000000000001111;
        BASE_SRAM[16] = 32'b001101_00000_00110_0000000000000010;
        BASE_SRAM[17] = 32'b011100_00011_00110_00111_00000_000010;
        BASE_SRAM[18] = 32'b000000_11111_00000_00000_00000_001000;
        BASE_SRAM[19] = 32'b000000_00000_00000_00000_00000_000000;        
        BASE_SRAM[20] = 32'b001101_00000_01000_0000000000001001;
*/

    end
    always #5 clk=~clk;
    initial begin
    rst = 0 ;
    #8
    rst = 1 ;
    #100000
    $stop;
    
    end
    
    
    system_top system_top(
        .clk             (clk),
        .rst             (rst),           
        .base_ram_addr   (base_ram_addr),
        .base_ram_data   (base_ram_data),
        .base_ram_be_n   (base_ram_be_n),
        .base_ram_ce_n   (base_ram_ce_n),
        .base_ram_oe_n   (base_ram_oe_n),
        .base_ram_we_n   (base_ram_we_n),           
        .ext_ram_addr    (ext_ram_addr),
        .ext_ram_data    (ext_ram_data),
        .ext_ram_be_n    (ext_ram_be_n),
        .ext_ram_ce_n    (ext_ram_ce_n),
        .ext_ram_oe_n    (ext_ram_oe_n),
        .ext_ram_we_n    (ext_ram_we_n)
        
    
    );
endmodule
